In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('fruits.csv', index_col=0)
# new_data = pd.read_csv('fruits.csv')
# new_data.set_index('fruits')
# new_data      -doesnt work

In [3]:
df['Score'] = [10, 15, 5, 20]

In [4]:
df.head(3)

          Quantity  Colors  Price  Score
Apples        40.0     red      3     10
banana        60.0  yellow      2     15
cherries      30.0     red      4      5

In [5]:
df.tail()

          Quantity  Colors  Price  Score
Apples        40.0     red      3     10
banana        60.0  yellow      2     15
cherries      30.0     red      4      5
dates         20.0   brown      5     20

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Apples to dates
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Quantity  4 non-null      float64
 1   Colors    4 non-null      object
 2   Price     4 non-null      int64
 3   Score     4 non-null      int64
dtypes: float64(1), int64(2), object(1)
memory usage: 160.0+ bytes

In [7]:
df.describe()

        Quantity     Price      Score
count   4.000000  4.000000   4.000000
mean   37.500000  3.500000  12.500000
std    17.078251  1.290994   6.454972
min    20.000000  2.000000   5.000000
25%    27.500000  2.750000   8.750000
50%    35.000000  3.500000  12.500000
75%    45.000000  4.250000  16.250000
max    60.000000  5.000000  20.000000

In [8]:
df['Quantity'].sum()

150.0

In [9]:
df.nlargest(3, 'Quantity')

          Quantity  Colors  Price  Score
banana        60.0  yellow      2     15
Apples        40.0     red      3     10
cherries      30.0     red      4      5

# Exercise 5

In [10]:
# ds.set_index('Fruit', inpase=True)
df.loc['banana', 'Quantity']

60.0

In [11]:
df.iloc[1]

Quantity      60.0
Colors      yellow
Price            2
Score           15
Name: banana, dtype: object

# Exercise 6

In [12]:
df['Sale_Price'] = df['Price']*0.9

In [13]:
df

          Quantity  Colors  Price  Score  Sale_Price
Apples        40.0     red      3     10         2.7
banana        60.0  yellow      2     15         1.8
cherries      30.0     red      4      5         3.6
dates         20.0   brown      5     20         4.5

In [14]:
df.rename(columns={'price': 'Original_Price'}, inplace=True)

In [15]:
df

          Quantity  Colors  Price  Score  Sale_Price
Apples        40.0     red      3     10         2.7
banana        60.0  yellow      2     15         1.8
cherries      30.0     red      4      5         3.6
dates         20.0   brown      5     20         4.5

In [16]:
df.drop('Colors', axis=1, inplace=True)

In [17]:
df

          Quantity  Price  Score  Sale_Price
Apples        40.0      3     10         2.7
banana        60.0      2     15         1.8
cherries      30.0      4      5         3.6
dates         20.0      5     20         4.5

# Exercise 7

In [18]:
grape_df = pd.DataFrame({
    "Quantity": [15], 
    "Sale_Price": [3.5],
    "Score": [10],
    "Price": [19]
}, index = ['Grapes'])
df = pd.concat([df, grape_df]) # pd.concat adds a new row

In [19]:
df

          Quantity  Price  Score  Sale_Price
Apples        40.0      3     10         2.7
banana        60.0      2     15         1.8
cherries      30.0      4      5         3.6
dates         20.0      5     20         4.5
Grapes        15.0     19     10         3.5

# Exercise 8

In [20]:
df['Quantity'].dtype

dtype('float64')

In [21]:
df['Quantity'] = df['Quantity'].astype('int32')

In [22]:
df

          Quantity  Price  Score  Sale_Price
Apples          40      3     10         2.7
banana          60      2     15         1.8
cherries        30      4      5         3.6
dates           20      5     20         4.5
Grapes          15     19     10         3.5

# Exercise 9

In [27]:
df['Quantity'].sum()

165

In [26]:
df.nlargest(1, 'Quantity')

        Quantity  Price  Score  Sale_Price
banana        60      2     15         1.8

In [30]:
df['Quantity'].idxmax()

'banana'

In [31]:
df['Quantity'].idxmin()

'Grapes'